In [4]:
# Задание 1
import pandas as pd
import numpy as np

a = {
    "author_id": [1, 2, 3],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
}

authors = pd.DataFrame(a)

authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [5]:
b = {
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
}

book = pd.DataFrame(b)

book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [37]:
# Задание 2
# Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

authors_price = pd.merge(authors, book, on='author_id', how='inner')

authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [17]:
#Задание 3
#Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.
authors_price_sort = authors_price.sort_values(by="price", ascending=False)

authors_price_sort

   author_id author_name            book_title  price
3          2       Чехов      Толстый и тонкий    500
0          1    Тургенев           Отцы и дети    450
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
2          1    Тургенев     Дворянское гнездо    350
1          1    Тургенев                 Рудин    300
6          3  Островский  Таланты и поклонники    290

In [19]:
top5 = authors_price_sort.iloc[0:5]

top5.reset_index(drop=True, inplace=True) # Сбросим индексы, чтобы они шли по порядку

top5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

In [25]:
# Задание 4
# Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
# author_name, min_price, max_price и mean_price,
# в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора.

groupby = authors_price.groupby("author_name")

mean_price = groupby["price"].mean()

mean_price

author_name
Островский    330.000000
Тургенев      366.666667
Чехов         475.000000
Name: price, dtype: float64

In [26]:
max_price = groupby["price"].max()

max_price

author_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [28]:
min_price = groupby["price"].min()

min_price

author_name
Островский    290
Тургенев      300
Чехов         450
Name: price, dtype: int64

In [29]:
authors_unique = authors_price["author_name"].unique()

authors_unique

array(['Островский', 'Тургенев', 'Чехов'], dtype=object)

In [33]:
authors_stat_data = {
    #"author_name": authors_unique,
    "mean_price": mean_price,
    "max_price": max_price,
    "min_price": min_price
}
authors_stat = pd.DataFrame(authors_stat_data)

authors_stat

             mean_price  max_price  min_price
author_name
Островский   330.000000        370        290
Тургенев     366.666667        450        300
Чехов        475.000000        500        450

In [34]:
# Задание 5**
cover = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [38]:
authors_price["cover"] = cover

authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [44]:
book_info = authors_price.pivot_table('price', index='author_name', columns='cover', aggfunc = {'price':sum})

book_info["мягкая"].fillna(0, inplace=True)

book_info["твердая"].fillna(0, inplace=True)

book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [45]:
book_info.to_pickle("book_info.pkl")

In [46]:
book_info2 = pd.read_pickle("book_info.pkl")

print(book_info2)

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0